espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_power.h
/* @brief PMIC mode pin configuration API parameter */
#define SYSCTL0_TUPLE_REG(reg) (*((volatile uint32_t *)(((uint32_t)(SYSCTL0)) + ((reg)&0xFFFU))))
typedef enum _pmic_mode_reg
{
    kCfg_Run   = 0x610,
    kCfg_Sleep = 0x600,
} pmic_mode_reg_t;

/* @brief Clock source of main clock before entering deep sleep. */
typedef enum _power_deep_sleep_clk
{
    kDeepSleepClk_LpOsc = 0U,
    kDeepSleepClk_Fro   = 3U,
} power_deep_sleep_clk_t;

/*!
 * @brief FBB voltage level select
 */
typedef enum _power_fbb_voltage_level_select
{
    kFbbNoBiasCondition   = 0U, /*!< No BIAS condition is selected. */
    kFbbVoltageLevel50Mv  = 1U, /*!< Voltage level at 50mV is selected. */
    kFbbVoltageLevel150Mv = 2U, /*!< Voltage level at 150mV is selected. */
    kFbbVoltageLevel100Mv = 3U, /*!< Voltage level at 100mV is selected. */
    kFbbVoltageLevel350Mv = 4U, /*!< Voltage level at 350mV is selected. */
    kFbbVoltageLevel300Mv = 5U, /*!< Voltage level at 300mV is selected. */
    kFbbVoltageLevel200Mv = 6U, /*!< Voltage level at 200mV is selected. */
    kFbbVoltageLevel250Mv = 7U, /*!< Voltage level at 250mV is selected. */
} power_fbb_voltage_level_select_t;

/*!
 * @brief RBB voltage level select
 */
typedef enum _power_rbb_voltage_level_select
{
    kRbbVoltageLevel0_5V = 0U, /*!< Voltage level at 0.5V is selected. */
    kRbbVoltageLevel0_6V = 1U, /*!< Voltage level at 0.6V is selected. */
    kRbbVoltageLevel0_7V = 2U, /*!< Voltage level at 0.7V is selected. */
    kRbbVoltageLevel0_8V = 3U, /*!< Voltage level at 0.8V is selected. */
    kRbbVoltageLevel0_9V = 4U, /*!< Voltage level at 0.9V is selected. */
    kRbbVoltageLevel1_0V = 5U, /*!< Voltage level at 1.0V is selected. */
    kRbbVoltageLevel1_1V = 6U, /*!< Voltage level at 1.1V is selected. */
    kRbbVoltageLevel1_2V = 7U, /*!< Voltage level at 1.2V is selected. */
    kRbbVoltageLevel1_3V = 8U, /*!< Voltage level at 1.3V is selected. */
} power_rbb_voltage_level_select_t;

/*!
 * @brief bias configuration.
 */
typedef struct _power_bias_config
{
    uint32_t
        RBBNWellVoltageLevelSelect : 4; /*!< Select RBB N-Well voltage level. @ref power_rbb_voltage_level_select_t */
    uint32_t : 4;                       /*!< Reserved. */
    uint32_t
        RBBPWellVoltageLevelSelect : 4; /*!< Select RBB P-Well voltage level. @ref power_rbb_voltage_level_select_t */
    uint32_t : 2;                       /*!< Reserved. */
    uint32_t EnableSramRBBPullDown : 1; /*!< Enable SRAM RBB pull-down. '1' means to enable pull-down. '0' means to
                                           disable pull-down. */
    uint32_t EnableRBBPullDown : 1;     /*!< Enable RBB pull-down. '1' means to enable pull-down. '0' means to disable
                                           pull-down.*/
    uint32_t
        FBBNWellVoltageLevelSelect : 4; /*!< Select FBB N-Well voltage level. @ref power_fbb_voltage_level_select_t */
    uint32_t : 4;                       /*!< Reserved. */
    uint32_t
        FBBPWellVoltageLevelSelect : 4; /*!< Select FBB P-Well voltage level. @ref power_fbb_voltage_level_select_t */
    uint32_t RBBSramPWellVoltageLevelSelect : 4; /*!< Select RBB SRAM P-Well voltage level. @ref
                                                    power_rbb_voltage_level_select_t */
} power_bias_config_t;

/*!
 * @brief pad voltage range value.
 */
typedef enum _power_pad_vrange_val
{
    kPadVol_171_360 = 0U, /*!< Voltage from 1.71V to 3.60V. */
    kPadVol_171_198 = 1U, /*!< Voltage from 1.71V to 1.98V. */
    kPadVol_300_360 = 2U, /*!< Voltage from 3.00V to 3.60V. */
} power_pad_vrange_val_t;

/*!
 * @brief pad voltage range configuration.
 */
typedef struct _power_pad_vrange
{
    uint32_t Vdde0Range : 2; /*!< VDDE0 voltage range for VDDIO_0. @ref power_pad_vrange_val_t */
    uint32_t Vdde1Range : 2; /*!< VDDE1 voltage range for VDDIO_1. @ref power_pad_vrange_val_t */
    uint32_t Vdde2Range : 2; /*!< VDDE2 voltage range for VDDIO_2. @ref power_pad_vrange_val_t */
    uint32_t Vdde3Range : 2; /*!< VDDE3 voltage range for VDDIO_3. @ref power_pad_vrange_val_t */
    uint32_t Vdde4Range : 2; /*!< VDDE4 voltage range for VDDIO_4. @ref power_pad_vrange_val_t */
    uint32_t : 22;           /*!< Reserved. */
} power_pad_vrange_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/*!
 * @brief API to enable PDRUNCFG bit in the Sysctl0. Note that enabling the bit powers down the peripheral
 *
 * @param en    peripheral for which to enable the PDRUNCFG bit
 * @return none
 */
static inline void POWER_EnablePD(pd_bit_t en)
{
    /* PDRUNCFGSET */
    SYSCTL0_PDRCFGSET_REG(en >> 8UL) = (1UL << (en & 0xFFU));
}

/*!
 * @brief API to disable PDRUNCFG bit in the Sysctl0. Note that disabling the bit powers up the peripheral
 *
 * @param en    peripheral for which to disable the PDRUNCFG bit
 * @return none
 */
static inline void POWER_DisablePD(pd_bit_t en)
{
    /* PDRUNCFGCLR */
    SYSCTL0_PDRCFGCLR_REG(en >> 8UL) = (1UL << (en & 0xFFU));
}

/*!
 * @brief API to enable deep sleep bit in the ARM Core.
 *
 * @param none
 * @return none
 */
static inline void POWER_EnableDeepSleep(void)
{
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
}

/*!
 * @brief API to disable deep sleep bit in the ARM Core.
 *
 * @param none
 * @return none
 */
static inline void POWER_DisableDeepSleep(void)
{
    SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
}

/**
 * @brief  API to updated XTAL oscillator settling time .
 * @param  osc_delay : OSC stabilization time in unit of microsecond
 * @return none
 */
void POWER_UpdateOscSettlingTime(uint32_t osc_delay);

/*!
 * @brief API to apply updated PMC PDRUNCFG bits in the Sysctl0.
 * @param none
 * @return none
 */
void POWER_ApplyPD(void);

/**
 * @brief   Clears the PMC event flags state.
 * @param   statusMask : A bitmask of event flags that are to be cleared.
 * @return  none
 */
void POWER_ClearEventFlags(uint32_t statusMask);

/**
 * @brief   Get the PMC event flags state.
 * @param   none
 * @return  PMC FLAGS register value
 */
uint32_t POWER_GetEventFlags(void);

/**
 * @brief   Enable the PMC interrupt requests.
 * @param   interruptMask : A bitmask of of interrupts to enable.
 * @return  none
 */
void POWER_EnableInterrupts(uint32_t interruptMask);

/**
 * @brief   Disable the PMC interrupt requests.
 * @param   interruptMask : A bitmask of of interrupts to disable.
 * @return  none
 */
void POWER_DisableInterrupts(uint32_t interruptMask);

/**
 * @brief   Set the PMC analog buffer for references or ATX2.
 * @param   enable : Set to true to enable analog buffer for references or ATX2, false to disable.
 * @return  none
 */
void POWER_SetAnalogBuffer(bool enable);

/**
 * @brief   Get PMIC_MODE pins configure value.
 * @param   reg : PDSLEEPCFG0 or PDRUNCFG0 register offset
 * @return  PMIC_MODE pins value in PDSLEEPCFG0
 */
static inline uint32_t POWER_GetPmicMode(pmic_mode_reg_t reg)
{
    return ((SYSCTL0_TUPLE_REG(reg) & (SYSCTL0_PDSLEEPCFG0_PMIC_MODE0_MASK | SYSCTL0_PDSLEEPCFG0_PMIC_MODE1_MASK)) >>
            SYSCTL0_PDRUNCFG0_PMIC_MODE0_SHIFT);
}

/**
 * @brief   Get RBB/FBB bit value.
 * @param   reg : PDSLEEPCFG0 or PDRUNCFG0 register offset
 * @return  Current body bias mode
 */
static inline body_bias_mode_t POWER_GetBodyBiasMode(pmic_mode_reg_t reg)
{
    return (body_bias_mode_t)(
        (SYSCTL0_TUPLE_REG(reg) & (SYSCTL0_PDRUNCFG0_RBB_PD_MASK | SYSCTL0_PDRUNCFG0_FBB_PD_MASK)) >>
        SYSCTL0_PDRUNCFG0_RBB_PD_SHIFT);
}

/*!
 * @brief Configure bias voltage level and enable/disable pull-down.
 *
 * This function change the RBB&FBB voltage level and RBB pull-down.
 *
 * @param config bias configuration structure pointer.
 */
void POWER_SetBiasConfig(const power_bias_config_t *config);

/*!
 * @brief Configure core voltage level in run mode (internal LDO).
 *
 * @param level steps above 0.595833V, each step increases volatge by 10.8333mV.
 *        Max level step value 0x32 which stands for 1.1375V.
 */
void POWER_SetRunCoreLevel(uint32_t level);

/*!
 * @brief Configure core voltage level in deep sleep mode (internal LDO).
 *
 * @param level steps above 0.595833V, each step increases volatge by 10.8333mV.
 *        Max level step value 0x32 which stands for 1.1375V.
 */
void POWER_SetDeepSleepCoreLevel(uint32_t level);

/*!
 * @brief Configure pad voltage level. Wide voltage range cost more power due to enabled voltage detector.
 *
 * NOTE: BE CAUTIOUS TO CALL THIS API. IF THE PAD SUPPLY IS BEYOND THE SET RANGE, SILICON MIGHT BE DAMAGED.
 *
 * @param config pad voltage range configuration.
 */
void POWER_SetPadVolRange(const power_pad_vrange_t *config);

/**
 * @brief   PMC Enter Rbb mode function call
 * @param   none
 * @return  none
 */
void POWER_EnterRbb(void);

/**
 * @brief   PMC Enter Fbb mode function call
 * @param   none
 * @return  none
 */
void POWER_EnterFbb(void);

/**
 * @brief   PMC exit Rbb & Fbb mode function call
 * @param   none
 * @return  none
 */
void POWER_EnterNbb(void);

/**
 * @brief   PMC Set Ldo volatage function call.
 * @param   main_clk_freq : main clock frequency value
 * @param   dsp_main_clk_freq : dsp main clock frequency value
 * @return  none
 */
void POWER_SetLdoVoltageForFreq(uint32_t main_clk_freq, uint32_t dsp_main_clk_freq);

/**
 * @brief   Set PMIC_MODE pins configure value.
 * @param   mode : PMIC MODE pin value
 * @param   reg : PDSLEEPCFG0 or PDRUNCFG0 register offset
 * @return  PMIC_MODE pins value in PDSLEEPCFG0
 */
void POWER_SetPmicMode(uint32_t mode, pmic_mode_reg_t reg);

/**
 * @brief   Set deep sleep clock source of main clock.
 * @param   clk : clock source of main clock.
 */
void POWER_SetDeepSleepClock(power_deep_sleep_clk_t clk);

/**
 * @brief   Configures and enters in SLEEP low power mode
 * @param   none
 * @return  none
 */
void POWER_EnterSleep(void);

/**
 * @brief   PMC Deep Sleep function call
 * @param   exclude_from_pd  Bit mask of the PDRUNCFG0 ~ PDRUNCFG3 that needs to be powered on during Deep Sleep mode
 * selected.
 * @return  none
 */
void POWER_EnterDeepSleep(const uint32_t exclude_from_pd[4]);

/**
 * @brief   PMC Deep Power Down function call
 * @param   exclude_from_pd  Bit mask of the PDRUNCFG0 ~ PDRUNCFG3 that needs to be powered on during Deep Power Down
 * mode selected.
 * @return  none
 */
void POWER_EnterDeepPowerDown(const uint32_t exclude_from_pd[4]);

/**
 * @brief   PMC Full Deep Power Down function call
 * @param   exclude_from_pd  Bit mask of the PDRUNCFG0 ~ PDRUNCFG3 that needs to be powered on during Full Deep Power
 * Down mode selected.
 * @return  none
 */
void POWER_EnterFullDeepPowerDown(const uint32_t exclude_from_pd[4]);

/*!
 * @brief Power Library API to enter different power mode.
 *
 * @param exclude_from_pd  Bit mask of the PDRUNCFG0 ~ PDRUNCFG3 that needs to be powered on during power mode selected.
 * @return none
 */
void POWER_EnterPowerMode(power_mode_cfg_t mode, const uint32_t exclude_from_pd[4]);

/*!
 * @brief Enable specific interrupt for wake-up from deep-sleep mode.
 * Enable the interrupt for wake-up from deep sleep mode.
 * Some interrupts are typically used in sleep mode only and will not occur during
 * deep-sleep mode because relevant clocks are stopped. However, it is possible to enable
 * those clocks (significantly increasing power consumption in the reduced power mode),
 * making these wake-ups possible.
 * @note This function also enables the interrupt in the NVIC (EnableIRQ() is called internally).
 * @param interrupt The IRQ number.
 * @return none
 */
void EnableDeepSleepIRQ(IRQn_Type interrupt);

/*!
 * @brief Disable specific interrupt for wake-up from deep-sleep mode.
 * Disable the interrupt for wake-up from deep sleep mode.
 * Some interrupts are typically used in sleep mode only and will not occur during
 * deep-sleep mode because relevant clocks are stopped. However, it is possible to enable
 * those clocks (significantly increasing power consumption in the reduced power mode),
 * making these wake-ups possible.
 * @note This function also disables the interrupt in the NVIC (DisableIRQ() is called internally).
 * @param interrupt The IRQ number.
 * @return none
 */
void DisableDeepSleepIRQ(IRQn_Type interrupt);

/*!
 * @brief Power Library API to return the library version.
 *
 * @param none
 * @return version number of the power library
 */
uint32_t POWER_GetLibVersion(void);

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* _FSL_POWER_H_ */
